Revit 2027 API
AdvancedWood.WoodFiberCosineProf Property
 The property labeled "Profile for fiber cosine function" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodFiberCosineProf { get; }
Public Shared ReadOnly Property WoodFiberCosineProf As String
	Get
public:
static property String^ WoodFiberCosineProf {
	String^ get ();
}
static member WoodFiberCosineProf : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace